{

    "Experience": [
        {
            "Company_name": "GenieAInow",
            "Position": "Software Developer",
            "Time_frame": "December 2024 - Present",
            "Company_logo": "/assets/images/Genie_AI_Now_Logo_Transparent.png",
            "Company_link" :"https://www.genieainow.com/genie-a.i-home-page",
            "Point1": "Pioneered cutting-edge AI/ML innovations by deploying LLM models with Python, Azure, and OpenAI, driving platform efficiency and user engagement.",
            "Point2": "Automated AI deployment pipelines with Azure DevOps, streamlining CI/CD processes for scalable and reliable AI/ML models.",
            "Point3": "Optimized model performance by fine-tuning LLMs and leveraging cloud computing for faster inference and reduced latency.",
            "Point4": " Strengthened system architecture, implementing robust MLOps strategies to enhance AI reliability and scalability.",
            "Point5": "Spearheaded AI-driven features, integrating advanced NLP and deep learning solutions to enhance user experience and business impact."
        },
        {
            "Company_name": "Skill Squirrel",
            "Position": "AI Developer",
            "Time_frame": "September 2024 - December 2024",
            "Company_logo": "/assets/images/Skill-Squirrel-LOGO-hori-PURPLE.png",
            "Company_link" :"https://www.skillsquirrel.com/",
            "Point1": "Revolutionized AI-powered interactions by seamlessly integrating OpenAI’s API with React and Azure, boosting user engagement by 25%.",
            "Point2": "Supercharged serverless computing by optimizing Azure Functions, achieving 99.9% uptime and slashing operational costs by 20%.",
            "Point3": "Engineered intelligent NLP features, elevating chatbot responsiveness and delivering a more human-like user experience.",
            "Point4": "Enhanced system efficiency through strategic API optimizations, reducing response times and maximizing performance.",
            "Point5": "Strengthened cloud infrastructure, ensuring scalable, resilient AI models for high-traffic applications."
        },
        {
            "Company_name": "Zeuty",
            "Position": "BackEnd Developer",
            "Time_frame": "June 2024 - November 2024",
            "Company_logo": "/assets/images/Zuety_logo.jpeg",
            "Company_link" :"",
            "Point1": "Create and maintain RESTful APIs to support front-end functionalities, ensuring seamless communication between server and client applications.",
            "Point2": "Integrate and manage Azure SQL Database services, leveraging cloud capabilities for high availability and scalability of backend systems.",
            "Point3": "Design, implement, and optimize SQL databases, ensuring data integrity and efficient query performance for robust data handling.",
            "Point4": "Utilize Git for version control, collaborating with team members through branching, merging, and pull requests to manage codebases effectively.",
            "Point5": "Develop and maintain server-side applications using Node.js, ensuring efficient and scalable performance."
        },
        {
            "Company_name": "Skill Squirrel",
            "Position": "Junior Software Developer",
            "Time_frame": "January 2024 - April 2024",
            "Company_logo": "/assets/images/Skill-Squirrel-LOGO-hori-PURPLE.png",
            "Company_link" :"https://www.skillsquirrel.com/",
            "Point1": "Led research efforts to utilize new technologies, such as Node.js API and Azure Prompt Flow, to enhance Skill Squirrel's feature integration.",
            "Point2": "Collaborated within a fully remote team to develop and implement a new feature for Skill Squirrel, leveraging Node.js API and Azure Prompt Flow to streamline user interactions and enhance user experience.",
            "Point3": "Utilized Jira and GitHub for project management and version control, creating branches and making pull/push requests to ensure code integrity and collaboration.",
            "Point4": "Managed personal local development environment setup, showcasing autonomy and self-motivation in a remote work setting.",
            "Point5": "Assisted in generating, evaluating, and analyzing data and reports to ensure accuracy and consistency."
        },
        {
            "Company_name": "Headstarter AI",
            "Position": "Software Develope Fellow",
            "Time_frame": "July 2024 - Present",
            "Company_logo": "/assets/images/theheadstarter_logo.jpeg",
            "Company_link" :"https://headstarter.co/",
            "Point1": "Selected for a competitive fellowship, emphasizing a strong background and dedication to software engineering.",
            "Point2": "Engaging with the open-source community by building and contributing to impactful projects, showcasing collaboration and technical skills.",
            "Point3": "Regularly participating in hackathons, demonstrating quick problem-solving abilities and innovative thinking under time constraints.",
            "Point4": "Undertaking a final project focused on developing a startup’s backlog to meet business requirements, illustrating real-world application and business acumen.",
            "Point5": "Gaining insights and knowledge from top professionals, enhancing technical expertise and expanding professional networks"
        }
    ]
}