{
      "Personal": {
        "first": "Prabal",
        "last": "Manchanda",
        "image": "./assets/images/My_Photo.jpeg",
        "occupation":"Software Developer",
        "about": "Hey there! I'm Prabal Manchanda, a passionate software developer who thrives on designing and coding innovative solutions. With a love for crafting digital experiences, I bring creativity and precision to every project I undertake. Let's build something extraordinary together.",
        "discription": "I design and code beautiful simple things, and I love doing it."

      },
      "Links": {
        "Linkedin": "https://www.linkedin.com/in/prabal-manchanda/",
        "GitHub": "https://github.com/Prabal31",
        "Email": "manchapr@sheridancollege.ca"
      },

    "projects": [
        {
        "name": "Portfolio Builder",
        "image": "/assets/images/Portfolio_builder.png",
        "technology_used": "Node.js, Azure, OpenAI API",
        "details": "In the world of Portfolio Builder, Node.js and OpenAI's GPT-4 collaborate to weave personalized portfolio tales. With HTML, CSS, and JavaScript, we've fashioned an intuitive interface, while battling bugs to ensure a seamless user experience. Join us on this thrilling journey, where your portfolio becomes a captivating narrative, and comprehensive documentation lights the path to triumph.",
        "github_link": "https://github.com/Prabal31/Portfolio-Builder.git"
        },
        {
        "name": "Virtual Bookstore",
        "image": "/assets/images/Bookstore.jpeg",
        "technology_used": "Java-Springboot, MySQL",
        "details": "Experience the seamless fusion of Java Spring Boot, MySQL, and dynamic frontend technologies in Virtual Bookstore. With robust Spring Security features, effortlessly navigate through three distinct user roles, while RESTful APIs ensure smooth communication for real-time interactions. From advanced admin management to seamless guest exploration, embark on a journey of efficient online browsing and purchasing. 📚✨",
        "github_link": "https://github.com/Prabal31/Book-Website/tree/main"
        },
        {
        "name": "Content Management System",
        "image": "/assets/images/Content_management_system.jpg",
        "technology_used": "PHP, JavaScript, MySQL",
        "details": "Discover a versatile Content Management System integrating PHP, JavaScript, and MySQL, tailored for seamless data management and real-time updates. Embracing industry-standard tools underscores a commitment to robust solutions and scalability. Addressing intricate challenges like real-time data updates and intuitive database interaction has refined problem-solving skills, fostering a drive for ongoing learning and industry relevancy.",
        "github_link": "https://github.com/Prabal31"
        }
    ],

    "Experience": [
        {
        "Company_name": "Skill Squirrel",
        "Position": "Junior Software Developer",
        "Time_frame": "January 2024 - April 2024",
        "Company_logo": "/assets/images/Skill-Squirrel-LOGO-hori-PURPLE.png",
        "Company_link" :"https://www.skillsquirrel.com/",
        "Point1": "Led research efforts to utilize new technologies, such as Node.js API and Azure Prompt Flow, to enhance Skill Squirrel's feature integration.",
        "Point2": "Collaborated within a fully remote team to develop and implement a new feature for Skill Squirrel, leveraging Node.js API and Azure Prompt Flow to streamline user interactions and enhance user experience.",
        "Point3": "Utilized Jira and GitHub for project management and version control, creating branches and making pull/push requests to ensure code integrity and collaboration.",
        "Point4": "Managed personal local development environment setup, showcasing autonomy and self-motivation in a remote work setting.",
        "Point5": "Assisted in generating, evaluating, and analyzing data and reports to ensure accuracy and consistency."
        },
        {
        "Company_name": "Zeuty",
        "Position": "BackEnd Developer",
        "Time_frame": "June 2024 - Present",
        "Company_logo": "/assets/images/Zuety_logo.jpeg",
        "Company_link" :"",
        "Point1": "Create and maintain RESTful APIs to support front-end functionalities, ensuring seamless communication between server and client applications.",
        "Point2": "Integrate and manage Azure SQL Database services, leveraging cloud capabilities for high availability and scalability of backend systems.",
        "Point3": "Design, implement, and optimize SQL databases, ensuring data integrity and efficient query performance for robust data handling.",
        "Point4": "Utilize Git for version control, collaborating with team members through branching, merging, and pull requests to manage codebases effectively.",
        "Point5": "Develop and maintain server-side applications using Node.js, ensuring efficient and scalable performance."
        }
    ]
}
      